//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2021, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************

/** @file MediaSanitizationDynamicSetup.uni
    Unicode string file that defines the strings used by the setup emodule
*/

#langdef   en-US "English"    // English

// setup items
#string STR_MEDIA_SANITIZATION                      #language en-US "Media Sanitization"

#string STR_MEDIA_SANITIZATION_CONFIGURATION        #language en-US "Media Sanitization Configuration"
#string STR_MEDIA_SANITIZATION_HELP                 #language en-US "Enter Media Sanitization Page."

#string STR_MEDIA_SANITIZE_DEVICE_NAME              #language en-US "Device Name"
#string STR_MEDIA_SANITIZE_DEVICE_NAME_HELP         #language en-US "Select the drive need to be sanitized\n"
                                                                    "Clear: applies logical techniques to sanitize data in all user-addressable storage locations through the standard Read and Write commands to the storage device\n"
                                                                    "Purge: applies physical or logical techniques that render Target Data recovery infeasible using state of the art laboratory techniques.\n"

#string STR_MEDIA_SANITIZATION_METHOD               #language en-US "Method Type"
#string STR_MEDIA_SANITIZATION_DISABLE              #language en-US "Disable"
#string STR_MEDIA_SANITIZATION_CLEAR                #language en-US "Clear"
#string STR_MEDIA_SANITIZATION_PURGE                #language en-US "Purge"
#string STR_SANITIZATION_METHOD_HELP                #language en-US "Select which method apply for this drive\n"
                                                                    "Default method : Clear\n"
                                                                    "Once select purge method , the supported command type for this drive will be shown below\n"

#string STR_MEDIA_SANITIZATION_COMMAND              #language en-US "Command Type"
#string STR_MEDIA_SANITIZATION_COMMAND_SANTIZE      #language en-US "Sanitize"
#string STR_MEDIA_SANITIZATION_COMMAND_SECURE_ERASE #language en-US "Secure Erase"
#string STR_MEDIA_SANITIZATION_COMMAND_FORMAT       #language en-US "Format"
#string STR_MEDIA_SANITIZATION_COMMAND_OPAL         #language en-US "Opal Erase"
#string STR_MEDIA_SANITIZATION_COMMAND_NONE         #language en-US "None"
#string STR_MEDIA_SANITIZATION_COMMAND_HELP         #language en-US "This sub-menu show the supported sanitize command of this drive\n"
                                                                    "Sanitize:The specific Sanitize command of each of kind drive for purge technique\n"
                                                                    "Secure Erase: leverages a firmware-based process to overwrite the media.\n"
                                                                    "This command typically executes substantially faster than through the native read/write interface\n"
                                                                    "Format:Only Nvme drive support this format command\n"                                                                    
                                                                    "Only Purge:Apply purge technique through the standard Read and Write commands\n"                                                                    
                                                                    
#string STR_MEDIA_FORMAT_DATA_MODE                  #language en-US "Secure Erase Setting"
#string STR_MEDIA_FORMAT_NO_SECURE                  #language en-US "None"
#string STR_MEDIA_FORMAT_USER_DATA                  #language en-US "UserData"
#string STR_MEDIA_FORMAT_CRYPTO                     #language en-US "CryptoGraphic"
#string STR_MEDIA_FORMAT_MODE_HELP                  #language en-US "User Data Erase: All user data shall be erased Cryptographic Erase: All user data shall be erased cryptographically."

#string STR_MEDIA_SANITIZATION_SANTIZE              #language en-US "Sanitize Feature"
#string STR_MEDIA_SANITIZATION_SANTIZE_VALUE        #language en-US "Unknown"
#string STR_MEDIA_SANITIZATION_SANTIZE_HELP         #language en-US "Indicate whether sanitize feature command are supported or unsupported"

#string STR_MEDIA_SANITIZATION_SECURE_ERASE         #language en-US "Secure Erase Feature"
#string STR_MEDIA_SANITIZATION_SECURITY_VALUE       #language en-US "Unknown"
#string STR_MEDIA_SANITIZATION_SECURITY_HELP        #language en-US "Indicate whether secure erase command are supported or unsupported"


#string STR_MEDIA_SANITIZATION_SECURE_ERASE_MODE    #language en-US "Secure Erase Mode"
#string STR_MEDIA_SANITIZATION_SECURE_ERASE         #language en-US "Secure Erase"
#string STR_MEDIA_SANITIZATION_SANITIZE             #language en-US "Sanitize"
#string STR_MEDIA_SANITIZATION_SECURE_ERASE_HELP    #language en-US "Clear disk with secure erase command."


#string STR_MEDIA_SANITIZATION_SANITIZE_MODE        #language en-US "Sanitize Mode"
#string STR_MEDIA_SANITIZATION_SANITIZE             #language en-US "Sanitize"
#string STR_MEDIA_SANITIZATION_SANITIZE_MODE_HELP   #language en-US "Clear disk with sanitize command."


#string STR_MEDIA_SANITIZATION_METHOD_MODE          #language en-US "Sanitize Method"
#string STR_MEDIA_SANITIZATION_METHOD_HELP          #language en-US "Crypto Erase , Block Erase , Overwrite Erase"
#string STR_MEDIA_SANITIZATION_METHOD_CRYPTO_ERASE      #language en-US "Crypto Erase"
#string STR_MEDIA_SANITIZATION_METHOD_BLOCK_ERASE       #language en-US "Block Erase"
#string STR_MEDIA_SANITIZATION_METHOD_OVERWRITE_ERASE   #language en-US "Overwrite Erase"

#string STR_MEDIA_SANITIZATION_PASSWORD_MODE        #language en-US "Password Type"
#string STR_MEDIA_SANITIZATION_USER                 #language en-US "User"
#string STR_MEDIA_SANITIZATION_MASTER               #language en-US "Master"
#string STR_MEDIA_SANITIZATION_PASSWORD_MODE_HELP   #language en-US "Compare user or master password."

#string STR_MEDIA_SANITIZATION_ERASE_MODE           #language en-US "Erase Mode"
#string STR_MEDIA_SANITIZATION_NORMAL               #language en-US "Normal"
#string STR_MEDIA_SANITIZATION_ENHANCE              #language en-US "Enhanced"
#string STR_MEDIA_SANITIZATION_ERASE_MODE_HELP      #language en-US "Normal Erase mode write vendor specific pattern and Enhanced Erase mode also erase password."

#string STR_MEDIA_SANITIZATION_START                #language en-US "Start Media Sanitization"
#string STR_MEDIA_SANITIZATION_START_HELP           #language en-US "Start sanitizing all devices with setup configuration."

#string STR_MEDIA_SANITIZATION_START_DEVICE         #language en-US "Start This Device Sanitization"
#string STR_MEDIA_SANITIZATION_START_HELP_DEVICE    #language en-US "Start sanitizing This Device with setup configuration."

#string STR_MEDIA_SANITIZATION_CONFIG               #language en-US "Media Sanitization device list"

// for dialog box
#string STR_MEDIA_SANITIZATION_SECURITY_PROMPT      #language en-US "HDD"

#string STR_MEDIA_SANITIZATION_ENTER_USER           #language en-US "Enter User password:"
#string STR_MEDIA_SANITIZATION_ENTER_MASTER         #language en-US "Enter Master password:"
#string STR_MEDIA_SANITIZATION_ENTER_OPAL_ADMIN     #language en-US "Enter Opal Admin password:"

#string STR_MEDIA_SANITIZATION_RUN                  #language en-US "Running..."
#string STR_MEDIA_SANITIZATION_WAIT                 #language en-US "Waiting..."
#string STR_MEDIA_SANITIZATION_DONE                 #language en-US "Operation done."
#string STR_MEDIA_SANITIZATION_EXIT                 #language en-US "Press any key"
#string STR_MEDIA_SANITIZATION_IDE_SANITZE          #language en-US "Warning! No power off before finish"

#string STR_MEDIA_SANITIZATION_PASSWORD             #language en-US "Enable Sanitization"
#string STR_MEDIA_SANITIZATION_PASSWORD_HELP        #language en-US "Allow Administrator enter Sanitization management Password"
#string STR_MEDIA_SANITIZATION_PASSWORD_PROMPT      #language en-US "Enter Management password:"
#string STR_MEDIA_SANITIZATION_PASSWORD_TITLE       #language en-US "AMI Sanitization Window"

#string STR_EMPTY                                   #language en-US ""

#string STR_METHOD_TYPE_CLEAR_MSG                   #language en-US "Method Type: Clear\n"
#string STR_METHOD_TYPE_PURGE_MSG                   #language en-US "Method Type: Purge\n"
#string STR_COMMAND_TYPE_NONE_MSG                   #language en-US "Command Type: None\n"
#string STR_COMMAND_TYPE_SANITIZE_MSG               #language en-US "Command Type: Sanitize\n"
#string STR_COMMAND_TYPE_SECURE_ERASE_MSG           #language en-US "Command Type: Secure Erase\n"
#string STR_COMMAND_TYPE_OPAL_ERASE_MSG             #language en-US "Command Type: Opal Erase\n"
#string STR_COMMAND_TYPE_FORMAT_MSG                 #language en-US "Command Type: Format NVM\n"

#string STR_PASSWORD_TYPE_USER_MSG                  #language en-US "Password Type: USER\n"
#string STR_PASSWORD_TYPE_MASTER_MSG                #language en-US "Password Type: MASTER\n"
#string STR_PASSWORD_TYPE_ADMIN_MSG                 #language en-US "Password Type: Admin\n"

#string STR_ERASE_MODE_NORMAL_MSG                   #language en-US "Erase Mode: NORMAL\n"
#string STR_ERASE_MODE_ENHANCED_MSG                 #language en-US "Erase Mode: ENHANCED\n"
#string STR_DEVICE_WARNING_MSG                      #language en-US "Please do NOT power off or unplug your device.\n"
#string STR_STAGE_STP_MSG                           #language en-US "Stage : %d of %d\n"

#string STR_WARNING_MSG                             #language en-US "Warning!!!"
#string STR_NOT_SUPPORT_SANITIZE_MSG                #language en-US "This disk does NOT support Sanitize feature.\nPlease reselect method.\n"
#string STR_NOT_SUPPORT_SECURE_ERASE_MSG            #language en-US "This disk does NOT support Secure Erase feature.\nPlease reselect method.\n"
#string STR_NOT_SUPPORT_OPAL_ERASE_MSG              #language en-US "This disk does NOT support Opal Erase feature.\nPlease reselect method.\n"
#string STR_NO_PASSWORD_SECURE_ERASE_MSG            #language en-US "This disk doesn't have passowrd set.\nSecure Erase will require password set.\n"
#string STR_NO_PASSWORD_OPAL_ERASE_MSG              #language en-US "This disk doesn't have Opal Admin passowrd set.\nPlease enter new password.\n"
#string STR_INVALID_PASSWORD_MSG                    #language en-US "Invalid Password.\nExit Media Sanitization process.\n"
#string STR_DATA_CLEAR_LONG_TIME_MSG                #language en-US "All data will be cleared. This action will take a long time.\nPlease do NOT power off or unplug your device.\nDo you want to continue.\n"
#string STR_AFTER_OPAL_ERASE_WARNING_MESSAGE        #language en-US "OPAL drive cleared.\n Advisable to Power Cycle System."

#string STR_MEDIA_SANITIZATION_CLEAR_COMPLETE_MSG          #language en-US "Clear Completed."
#string STR_MEDIA_SANITIZATION_PURGE_COMPLETE_MSG          #language en-US "Purge Completed."
#string STR_MEDIA_SANITIZATION_SANITIZE_COMPLETE_MSG       #language en-US "Sanitize Completed."
#string STR_MEDIA_SANITIZATION_SECURE_ERASE_COMPLETE_MSG   #language en-US "Secure Erase Completed."
#string STR_MEDIA_SANITIZATION_OPAL_ERASE_COMPLETE_MSG     #language en-US "Opal Erase Completed."
#string STR_MEDIA_SANITIZATION_FORMAT_COMPLETE_MSG         #language en-US "Format Completed."

#string STR_MEDIA_SANITIZATION_DEVICE_ERROR_MSG            #language en-US "Device error.\nProcess terminated."
#string STR_MEDIA_SANITIZATION_UNEXPECTED_ERROR_MSG        #language en-US "Unexpected error.\nProcess terminated."

//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2021, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************